ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAML21/include/component/comp_rtc.h
/* -------- RTC_MODE1_SYNCBUSY : (RTC Offset: 0x10) (R/  32) MODE1 MODE1 Synchronization Busy Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t SWRST: 1;         /*!< bit:      0  Software Reset Bit Busy            */
        uint32_t ENABLE: 1;        /*!< bit:      1  Enable Bit Busy                    */
        uint32_t FREQCORR: 1;      /*!< bit:      2  FREQCORR Register Busy             */
        uint32_t COUNT: 1;         /*!< bit:      3  COUNT Register Busy                */
        uint32_t PER: 1;           /*!< bit:      4  PER Register Busy                  */
        uint32_t COMP0: 1;         /*!< bit:      5  COMP 0 Register Busy               */
        uint32_t COMP1: 1;         /*!< bit:      6  COMP 1 Register Busy               */
        uint32_t : 8;              /*!< bit:  7..14  Reserved                           */
        uint32_t SYNCDIS: 1;       /*!< bit:     15  Count Read Synchronization Disable Bit Busy */
        uint32_t : 16;             /*!< bit: 16..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t : 5;              /*!< bit:  0.. 4  Reserved                           */
        uint32_t COMP: 2;          /*!< bit:  5.. 6  COMP x Register Busy               */
        uint32_t : 25;             /*!< bit:  7..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} RTC_MODE1_SYNCBUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE1_SYNCBUSY_OFFSET   0x10         /**< \brief (RTC_MODE1_SYNCBUSY offset) MODE1 Synchronization Busy Status */
#define RTC_MODE1_SYNCBUSY_RESETVALUE 0x00000000ul /**< \brief (RTC_MODE1_SYNCBUSY reset_value) MODE1 Synchronization Busy Status */

#define RTC_MODE1_SYNCBUSY_SWRST_Pos 0            /**< \brief (RTC_MODE1_SYNCBUSY) Software Reset Bit Busy */
#define RTC_MODE1_SYNCBUSY_SWRST    (0x1ul << RTC_MODE1_SYNCBUSY_SWRST_Pos)
#define RTC_MODE1_SYNCBUSY_ENABLE_Pos 1            /**< \brief (RTC_MODE1_SYNCBUSY) Enable Bit Busy */
#define RTC_MODE1_SYNCBUSY_ENABLE   (0x1ul << RTC_MODE1_SYNCBUSY_ENABLE_Pos)
#define RTC_MODE1_SYNCBUSY_FREQCORR_Pos 2            /**< \brief (RTC_MODE1_SYNCBUSY) FREQCORR Register Busy */
#define RTC_MODE1_SYNCBUSY_FREQCORR (0x1ul << RTC_MODE1_SYNCBUSY_FREQCORR_Pos)
#define RTC_MODE1_SYNCBUSY_COUNT_Pos 3            /**< \brief (RTC_MODE1_SYNCBUSY) COUNT Register Busy */
#define RTC_MODE1_SYNCBUSY_COUNT    (0x1ul << RTC_MODE1_SYNCBUSY_COUNT_Pos)
#define RTC_MODE1_SYNCBUSY_PER_Pos  4            /**< \brief (RTC_MODE1_SYNCBUSY) PER Register Busy */
#define RTC_MODE1_SYNCBUSY_PER      (0x1ul << RTC_MODE1_SYNCBUSY_PER_Pos)
#define RTC_MODE1_SYNCBUSY_COMP0_Pos 5            /**< \brief (RTC_MODE1_SYNCBUSY) COMP 0 Register Busy */
#define RTC_MODE1_SYNCBUSY_COMP0    (1 << RTC_MODE1_SYNCBUSY_COMP0_Pos)
#define RTC_MODE1_SYNCBUSY_COMP1_Pos 6            /**< \brief (RTC_MODE1_SYNCBUSY) COMP 1 Register Busy */
#define RTC_MODE1_SYNCBUSY_COMP1    (1 << RTC_MODE1_SYNCBUSY_COMP1_Pos)
#define RTC_MODE1_SYNCBUSY_COMP_Pos 5            /**< \brief (RTC_MODE1_SYNCBUSY) COMP x Register Busy */
#define RTC_MODE1_SYNCBUSY_COMP_Msk (0x3ul << RTC_MODE1_SYNCBUSY_COMP_Pos)
#define RTC_MODE1_SYNCBUSY_COMP(value) ((RTC_MODE1_SYNCBUSY_COMP_Msk & ((value) << RTC_MODE1_SYNCBUSY_COMP_Pos)))
#define RTC_MODE1_SYNCBUSY_SYNCDIS_Pos 15           /**< \brief (RTC_MODE1_SYNCBUSY) Count Read Synchronization Disable Bit Busy */
#define RTC_MODE1_SYNCBUSY_SYNCDIS  (0x1ul << RTC_MODE1_SYNCBUSY_SYNCDIS_Pos)
#define RTC_MODE1_SYNCBUSY_MASK     0x0000807Ful /**< \brief (RTC_MODE1_SYNCBUSY) MASK Register */

/* -------- RTC_MODE2_SYNCBUSY : (RTC Offset: 0x10) (R/  32) MODE2 MODE2 Synchronization Busy Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t SWRST: 1;         /*!< bit:      0  Software Reset Bit Busy            */
        uint32_t ENABLE: 1;        /*!< bit:      1  Enable Bit Busy                    */
        uint32_t FREQCORR: 1;      /*!< bit:      2  FREQCORR Register Busy             */
        uint32_t CLOCK: 1;         /*!< bit:      3  CLOCK Register Busy                */
        uint32_t : 1;              /*!< bit:      4  Reserved                           */
        uint32_t ALARM0: 1;        /*!< bit:      5  ALARM 0 Register Busy              */
        uint32_t : 5;              /*!< bit:  6..10  Reserved                           */
        uint32_t MASK0: 1;         /*!< bit:     11  MASK 0 Register Busy               */
        uint32_t : 3;              /*!< bit: 12..14  Reserved                           */
        uint32_t SYNCDIS: 1;       /*!< bit:     15  Clock Read Synchronization Disable Bit Busy */
        uint32_t : 16;             /*!< bit: 16..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t : 5;              /*!< bit:  0.. 4  Reserved                           */
        uint32_t ALARM: 1;         /*!< bit:      5  ALARM x Register Busy              */
        uint32_t : 5;              /*!< bit:  6..10  Reserved                           */
        uint32_t MASK: 1;          /*!< bit:     11  MASK x Register Busy               */
        uint32_t : 20;             /*!< bit: 12..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} RTC_MODE2_SYNCBUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE2_SYNCBUSY_OFFSET   0x10         /**< \brief (RTC_MODE2_SYNCBUSY offset) MODE2 Synchronization Busy Status */
#define RTC_MODE2_SYNCBUSY_RESETVALUE 0x00000000ul /**< \brief (RTC_MODE2_SYNCBUSY reset_value) MODE2 Synchronization Busy Status */

